Revit 2026 API

# DocumentWorksharingEnabledEventArgs Class

---

The event arguments used by the DocumentWorksharingEnabled event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPISingleEventArgs Autodesk.Revit.DB.EventsDocumentWorksharingEnabledEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DocumentWorksharingEnabledEventArgs : RevitAPISingleEventArgs
```
```vb
Public Class DocumentWorksharingEnabledEventArgs
	Inherits RevitAPISingleEventArgs
```
```cpp
public ref class DocumentWorksharingEnabledEventArgs : public RevitAPISingleEventArgs
```
```fsharp
type DocumentWorksharingEnabledEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
```

The DocumentWorksharingEnabledEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDocument | Returns document associated with this event |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace